#Вывести на экран числа от -N до N
n = int(input())
range(-n, n+1) # range(-n, n) - числа от [-n  до n)

# for n in range(-n, n+1):
#     print(n)
print(range(-n, n+1))